emacs/emacs-can-do-what.html

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<title>GNU/Emacs 可以做什么</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="GNU/Emacs 可以做什么"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-27 六"/>
<meta name="author" content="孤峰独秀"/>
<meta name="description" content="GNU/Emacs 可以做什么"/>
<meta name="keywords" content="emacs "/>
<link rel="stylesheet" type="text/css" href="../style/emacs.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../sitemap.html"> 站点地图 </a>
 |
 <a accesskey="H" href="../index.html"> 首页 </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">GNU/Emacs 可以做什么</h1>


<div id='logo-img' ><a  href='../index.html'>▇█▓▒░◕~◕░▒▓█▇</a></div>

<div id='logo-text'>
  <a href='#' ><span align="left">░◕~◕░</span></a>
</div>

<p>
我所有的Emacs相关的配置，在 <a href="https://github.com/jixiuf/emacs_conf">https://github.com/jixiuf/emacs_conf</a> 可以找到<br/>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">yasnippet (yet another snippet) 浙大一牛人为Emacs写的插件 模版</a></li>
<li><a href="#sec-2">我为csharp 写的生成seter getter 的函数</a></li>
<li><a href="#sec-3">(我写的函数)自动生成sql server 的建表语句</a></li>
<li><a href="#sec-4">Emacs 的列编辑模式(Emacs称矩形编辑rect),</a></li>
<li><a href="#sec-5">美化sql</a></li>
<li><a href="#sec-6">作为数据库前端，以oracle ,mysql 为例</a></li>
<li><a href="#sec-7">（我写的）编写mysql 脚本时，适时的补全表名列名</a></li>
<li><a href="#sec-8">(我写的)编写oracle 脚本时，适时的补全表名列名</a></li>
<li><a href="#sec-9">（我写的）AutoJavaComplete 编写Java代码时自动补全</a></li>
<li><a href="#sec-10">dired (Emacs的文件管理系统(资源管理器))</a></li>
<li><a href="#sec-11">org-mode 非程序员的mode</a></li>
<li><a href="#sec-12">org-mode 将org mode 编写的文件导出成单个html文件，</a></li>
<li><a href="#sec-13">org-mode 将某目录下所有org 文件，以个人站点的形式，导出</a></li>
<li><a href="#sec-14">org-table ,org-mode 中的表格</a></li>
<li><a href="#sec-15">在emacs使用stardict 词典,需要sdvc(命令行下的stardict) 支持</a></li>
<li><a href="#sec-16">emacs中的游戏</a></li>
<li><a href="#sec-17">diff 文件的比较</a></li>
<li><a href="#sec-18">diff 版本控制工具中各版本的差异</a></li>
<li><a href="#sec-19">在svn 或git等版本控制工具管理的文件里，查看此文件的历史</a></li>
<li><a href="#sec-20">Version Control</a></li>
<li><a href="#sec-21">Ediff 文件的合并，对比的工具，一般与版本控制工具使用，如git ,svn.</a></li>
<li><a href="#sec-22">录制键盘宏</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">yasnippet (yet another snippet) 浙大一牛人为Emacs写的插件 模版</h2>
<div class="outline-text-2" id="text-1">

<p>  它可以 为 html java cs c c++ ,所有你可以想像的到的语言定义 模版， 语法极<br/>
  简单<br/>
  <a href="http://code.google.com/p/yasnippet/">http://code.google.com/p/yasnippet/</a><br/>
  官网上有完整的关于yasnippet的视频<br/>
  <a href="http://yasnippet.googlecode.com/files/yas_demo.mp4">http://yasnippet.googlecode.com/files/yas\_demo.mp4</a><br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">我为csharp 写的生成seter getter 的函数</h2>
<div class="outline-text-2" id="text-2">

<p>将选中区域内的所有格式为<br/>
private DateTime LAST_MONTH_CHECKSTOCK_DATE;<br/>
private DateTime last;<br/>
的变量，替换成<br/>
private DateTime LAST_MONTH_CHECKSTOCK_DATE;<br/>
public DateTime Last_Month_Checkstock_Date<br/>
{<br/>
set {LAST_MONTH_CHECKSTOCK_DATE=value ;}<br/>
get {return LAST_MONTH_CHECKSTOCK_DATE ;}<br/>
}<br/>
private DateTime last;<br/>
public DateTime Last<br/>
{<br/>
set {last=value ;}<br/>
get {return last ;}<br/>
}<br/>
</p>
<p><br/>
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">csharp-setter-getter</span>(beg end)
<span class="org-doc">"generate sets and gets for c#."</span>
(interactive <span class="org-string">"r"</span>)
(<span class="org-keyword">let</span> ((region-string (buffer-substring-no-properties beg end))
      var var-type   capitalize-var set-gets)
  (<span class="org-keyword">with-temp-buffer</span>
    (csharp-mode)
    (insert region-string) (insert <span class="org-string">"\n"</span>)
    (goto-char (point-min))(end-of-line)
    (<span class="org-keyword">while</span> (<span class="org-keyword">not</span> (eobp))
      (<span class="org-keyword">if</span> (string-match <span class="org-string">"^[ \t]*$"</span> (buffer-substring-no-properties (point-at-bol) (point-at-eol)))
          (<span class="org-keyword">progn</span> (forward-line)(end-of-line))
        (backward-sexp)
        (<span class="org-function-name">setq</span> var (thing-at-point 'sexp))
        (backward-sexp)
        (<span class="org-function-name">setq</span> var-type (thing-at-point 'sexp))
        (kill-region (point-at-bol) (point-at-eol))
        (insert (csharp-a-setter-getter var-type var))
        (forward-line)(end-of-line)))
    (indent-region (point-min) (point-max))
    (<span class="org-function-name">setq</span> set-gets (buffer-string))
    )
  (kill-region beg end)
  (insert set-gets)
  )
)
</pre>


</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">(我写的函数)自动生成sql server 的建表语句</h2>
<div class="outline-text-2" id="text-3">

<p>  根据格式如下的一段内容自动生成sql server  的create table 语句<br/>
 STOCK_ID                                   IDENTITY<br/>
 SEMIFINISHER_ID                                    INT<br/>
 STOCK_WEIGHT                                   DECIMAL                 18,2<br/>
 STOCK_YEAR_MONTH                                   DATATIME<br/>
 START_WEIGHT                                   DECIMAL                 18,2<br/>
 CREATE_DATETIME                                    DATETIME<br/>
 CREATER_ID                                 NVARCHAR                    20<br/>
 UPDATE_DATETIME                                    DATETIME<br/>
 UPDATER_ID                                 NVARCHAR                    20<br/>
 DELETE_FLG                                 NVARCHAR                    1<br/>
</p>
<p>  <br/>
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Emacs 的列编辑模式(Emacs称矩形编辑rect),</h2>
<div class="outline-text-2" id="text-4">

<p>  Emacs 不仅可以选择几行数据，而且可以选择列<br/>
  我用到的与列编辑有关的 扩展<br/>
  <a href="http://www.emacswiki.org/emacs/rect-mark.el">http://www.emacswiki.org/emacs/rect-mark.el</a><br/>
  我定义的快捷键<br/>
  Alt+space 设置mark<br/>
  C-x-r-k(Control+x,r,k) 列删除<br/>
  C-x-r-t                列插入<br/>
  C-x-r-y                列粘贴<br/>
</p>
<p>  <br/>
比如以下此为例<br/>
 1删除每行开头的分号<br/>
 2 在每行开头插入# <br/>
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">美化sql</h2>
<div class="outline-text-2" id="text-5">

<p>  需要 blancosqlformatter-0.1.1.jar 作后台进程处理 <br/>
  <a href="http://www.emacswiki.org/emacs/SqlBeautify">http://www.emacswiki.org/emacs/SqlBeautify</a><br/>
</p>
<p>  <br/>
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">作为数据库前端，以oracle ,mysql 为例</h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">（我写的）编写mysql 脚本时，适时的补全表名列名</h2>
<div class="outline-text-2" id="text-7">

<p>  <a href="http://www.emacswiki.org/emacs/sqlparser-mysql-complete.el">http://www.emacswiki.org/emacs/sqlparser-mysql-complete.el</a><br/>
</p></div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">(我写的)编写oracle 脚本时，适时的补全表名列名</h2>
<div class="outline-text-2" id="text-8">

<p>  <a href="http://www.emacswiki.org/emacs/sqlparser-oracle-complete.el">http://www.emacswiki.org/emacs/sqlparser-oracle-complete.el</a><br/>
</p></div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">（我写的）AutoJavaComplete 编写Java代码时自动补全</h2>
<div class="outline-text-2" id="text-9">

<p>  <a href="http://www.emacswiki.org/emacs/AutoJavaComplete">http://www.emacswiki.org/emacs/AutoJavaComplete</a><br/>
</p></div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">dired (Emacs的文件管理系统(资源管理器))</h2>
<div class="outline-text-2" id="text-10">

<p>  此例演示使用dired文件管理系统及 第四讲中提到的列编辑<br/>
  模式批量重命名文件<br/>
</p>
<p>  <br/>
</p></div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">org-mode 非程序员的mode</h2>
<div class="outline-text-2" id="text-11">

<p>  我现在编写的这个文件使用的mode 就是org-mode<br/>
  它的第一特定是TAB 进行折叠<br/>
  整个文件其实很大，但是现在只显示骨架，整体结构很清晰.<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">org-mode 将org mode 编写的文件导出成单个html文件，</h2>
<div class="outline-text-2" id="text-12">

<p>  在orgmode模式下  C-cC-e 之后，可以导出成多种格式，<br/>
   以导出此文件为例<br/>
</p></div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">org-mode 将某目录下所有org 文件，以个人站点的形式，导出</h2>
<div class="outline-text-2" id="text-13">

<p>  比如，将我的 <i>home/jixiuf/documents/org/src</i><br/>
  目录下的所有org 文件，导出成html 放到<br/>
  <i>home/jixiuf/documents/org/public_html</i><br/>
  目录下为例<br/>
</p>
<p>  <br/>
</p></div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">org-table ,org-mode 中的表格</h2>
<div class="outline-text-2" id="text-14">


<p>  <br/>
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">head</td><td class="left">head2</td><td class="left">head3</td></tr>
<tr><td class="left">hello</td><td class="left">world</td><td class="left">ok</td></tr>
<tr><td class="left">this</td><td class="left">is</td><td class="left">come</td></tr>
<tr><td class="left">a text</td><td class="left">table</td><td class="left">on</td></tr>
</tbody>
</table>


<p><br/>
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">another</th><th scope="col" class="left">one</th></tr>
</thead>
<tbody>
<tr><td class="left">ok</td><td class="left">ok</td></tr>
<tr><td class="left">Idon't know</td><td class="left">can you editor do this</td></tr>
</tbody>
</table>


<p><br/>
</p></div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">在emacs使用stardict 词典,需要sdvc(命令行下的stardict) 支持</h2>
<div class="outline-text-2" id="text-15">

<p>  ，将下面函数绑定到`C-cd'上 .光标移动到单词上,按下C-cd即可查词典<br/>
</p>
<p><br/>
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sdcv-to-buffer</span> ()
  <span class="org-doc">"Search dict in region or world."</span>
  (interactive)
  (<span class="org-keyword">let</span> ((word (<span class="org-keyword">if</span> mark-active
                  (buffer-substring-no-properties (region-beginning) (region-end))
                (current-word <span class="org-constant">nil</span> <span class="org-constant">t</span>)))
        (buf-name (buffer-name))
        )
    <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq word (read-string (format "Search the dictionary for (default %s): " word)</span>
    <span class="org-comment-delimiter">;;                         </span><span class="org-comment">nil nil word))</span>
    (set-buffer (get-buffer-create <span class="org-string">"*sdcv*"</span>))
    (buffer-disable-undo)
    (erase-buffer)
    (insert (shell-command-to-string  (format <span class="org-string">"sdcv -n %s "</span> word) ))
    (<span class="org-keyword">if</span> (<span class="org-keyword">equal</span> buf-name <span class="org-string">"*sdcv*"</span>)
        (switch-to-buffer <span class="org-string">"*sdcv*"</span>)
      (switch-to-buffer-other-window <span class="org-string">"*sdcv*"</span>)
      )
    (goto-char (point-min))
    ))
</pre>

</p></div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">emacs中的游戏</h2>
<div class="outline-text-2" id="text-16">

</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17">diff 文件的比较</h2>
<div class="outline-text-2" id="text-17">

<p>  比较两个文件的不同<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18">diff 版本控制工具中各版本的差异</h2>
<div class="outline-text-2" id="text-18">

<p>  C-xv=  对工作区中的文件与版本控制下的最新版进行比较<br/>
  比如，我所有的emacs配置文件使用git 进行版本管理,<br/>
</p></div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19">在svn 或git等版本控制工具管理的文件里，查看此文件的历史</h2>
<div class="outline-text-2" id="text-19">

<p>  C-xvl 查看历史,<br/>
</p>
<p>  <br/>
</p></div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20">Version Control</h2>
<div class="outline-text-2" id="text-20">

<p>  emacs 有一个Version Control ，它试图将所有现存的版本管理工具<br/>
  如svn cvs git 等等版本控制工具在emacs中的使用方式得到统一<br/>
  比如，不论你是svn 还是git ,<br/>
  C-xvl 都是查看此文件的历史<br/>
  C-xv+ 更新此文件到最新版<br/>
  C-xvu revert<br/>
  而功能最强大的功能C-xvv 对应的，它会根据当前文件所处的状态，自动<br/>
  决定下一部操作该如何做<br/>
</p>
<p>  <br/>
</p></div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21">Ediff 文件的合并，对比的工具，一般与版本控制工具使用，如git ,svn.</h2>
<div class="outline-text-2" id="text-21">

</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22">录制键盘宏</h2>
<div class="outline-text-2" id="text-22">

<p>  另外说一点我对键盘和鼠标的一些看法，不想带有太多的偏见.<br/>
  键盘的优点是:每一次击键都是确定的，具有可重复性<br/>
  鼠标优点是易用，但是每次点击所对应的坐标，不太具有可重复性<br/>
  这一次在(100,200)处点击的是确定按钮，下一次可能就是其他按钮了.<br/>
  所以你没法记住一个坐标，然后将它重复点击n次(就算能，可重复性相对键盘较差<br/>
  一点,说到这，推荐大家学习一下AutoHotKey这款开源软件).<br/>
</p>
<p>  <br/>
  而Emacs 用熟了之后，是要完全脱离鼠标的使用的，虽然它也添加了对鼠标的支持，<br/>
  鼠标、菜单栏、工具栏只起一个辅助作用.<br/>
</p>
<p><br/>
  键盘的每一次按键是确定的，每一个按键序列都对应着Emacs中的一个命令<br/>
  (Command). 如此，将一段同样的操作录制下来，重复多次，便可以简化繁琐的重复<br/>
  性操作<br/>
  C-x(  开始录制键盘宏<br/>
  C-x)  结束录制键盘宏<br/>
  C-xe  重复最近录制的键盘宏<br/>
  C-u3C-xe 重复3次最近录制的键盘宏<br/>
  C-u0C-xe 重复无数次最近录制的键盘宏,直到遇到错误<br/>
</p>
<p><br/>
  演示示例，<br/>
  有这样一段内容，它们以冒号进行分隔，现在把每一行以冒号分隔的最后一部分内<br/>
  容删掉<br/>
  下面进行操作<br/>
  录制完成<br/>
  C-xe 调用<br/>
  其实可以C-u4C-xe 调用4次即可<br/>
  四次调用<br/>
</p><blockquote>

<p>root:x:0:<br/>
bin:x:1:<br/>
daemon:x:2:<br/>
sys:x:3:<br/>
adm:x:4:<br/>
</p>
</blockquote>


<p><br/>
  分析：<br/>
   1 把光标移动到第一行的末尾<br/>
     M-&lt;   (实际是Shift-Alt+,) (beginning-of-buffer) 函数，跳到第一行<br/>
     C-e    (Control-e)       (move-end-of-line)  移动到行尾<br/>
   2 开始录制键盘宏 C-x(        (kmacro-start-macro)  <br/>
      C-backspace              (backward-kill-word) 删除光标前的一个单词<br/>
      C-n                      (next-line)          光标移动到下一行<br/>
      C-e                       (move-end-of-line)  移动到行尾<br/>
      注意开始录制的时候光标所处的位置，与录制结束后所处的位置应该相似 ,才<br/>
     能使录制的内容多次执行后无误 (比如此处均处于每行的末尾) <br/>
   3 结束录制键盘宏 C-x)        (kmacro-end-macro)<br/>
</p>
<p><br/>
<div id='my-src'>
<div id='org-src'><a href='../src/emacs/emacs-can-do-what.org'>src</a></div>
<div id='htmlized-src'><a href='../htmlized-src/emacs/emacs-can-do-what.org.html'>htmlized-src</a></div>
</div>
<div id='tags'><span id='tags-title'>Tags:</span><br />
    <a href="../tags/@SVN.html">@SVN</a><br/>
    <a href="../tags/@perl.html">@perl</a><br/>
    <a href="../tags/@Java.html">@Java</a><br/>
    <a href="../tags/@Mysql.html">@Mysql</a><br/>
    <a href="../tags/@Erlang.html">@Erlang</a><br/>
    <a href="../tags/@SQL.html">@SQL</a><br/>
    <a href="../tags/@DB.html">@DB</a><br/>
    <a href="../tags/@Oracle.html">@Oracle</a><br/>
    <a href="../tags/@Ediff.html">@Ediff</a><br/>
    <a href="../tags/@Git.html">@Git</a><br/>
    <a href="../tags/@Cedet.html">@Cedet</a><br/>
    <a href="../tags/@C-C++.html">@C-C++</a><br/>
    <a href="../tags/@Daily.html">@Daily</a><br/>
    <a href="../tags/@Eclipse.html">@Eclipse</a><br/>
    <a href="../tags/@AutoHotKey.html">@AutoHotKey</a><br/>
    <a href="../tags/@Windows.html">@Windows</a><br/>
    <a href="../tags/@Linux.html">@Linux</a><br/>
    <a href="../tags/@C.html">@C</a><br/>
    <a href="../tags/@Emacs.html">@Emacs</a><br/>
</p>
<p><br/>
</div>
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-27 六</p>
<p class="author">Author: 孤峰独秀</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>


</div>
<p><br/><br/>
<!-- hhmts start --> <!-- hhmts end --></p>

</body>
</html>
